api/app/controllers/api/v1/users_controller.rb

  def show
    user = User.find(params[:id])
    render json: user.includes(:entries).include['diagnoses', 'entries']
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "diagnoses".* FROM "diagnoses" WHERE "diagnoses"."user_id" = $1  [["user_id", 1]]